phase1_derating/cfd/heater_unitcell/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| Velocity. Crossflow in +y at Re ~ 1e4 (inlet U = 6.3623 m/s).                |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 6.3623 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 6.3623 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 6.3623 0);
    }
    tube
    {
        type            noSlip;
    }
    "cyclic.*"
    {
        type            cyclic;
    }
    "symZ.*"
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
