phase1_derating/cfd/heater_unitcell/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| Turbulent thermal diffusivity (derived). Compressible wall function on tube.  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    tube
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    "cyclic.*"
    {
        type            cyclic;
    }
    "symZ.*"
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
