phase1_derating/cfd/heater_unitcell/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| Turbulent kinematic viscosity (derived). Wall-resolved y+ <= 2 -> Spalding    |
| blended wall function (valid through the viscous sublayer/buffer layer).      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    tube
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    "cyclic.*"
    {
        type            cyclic;
    }
    "symZ.*"
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
