phase1_derating/cfd/heater_unitcell/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| Specific dissipation rate. omega = sqrt(k)/(Cmu^0.25 L), L = 0.1 d0 = 2.54mm. |
| omega_inlet = sqrt(0.1518)/(0.09^0.25 * 0.00254) ~= 280 /s.                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 280;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 280;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 280;
        value           uniform 280;
    }
    tube
    {
        type            omegaWallFunction;
        value           uniform 280;
    }
    "cyclic.*"
    {
        type            cyclic;
    }
    "symZ.*"
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
