phase1_derating/cfd/heater_unitcell/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| RAS k-omega SST, low-Re wall resolution (y+ <= 2).                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}

// ************************************************************************* //
