phase1_derating/cfd/heater_unitcell/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| Steady compressible solve (rhoSimpleFoam) with wall-heat-flux / y+ probes.   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoSimpleFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         900;
deltaT          1;
writeControl    timeStep;
writeInterval   100;
purgeWrite      2;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    yPlus1
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }

    wallHeatFlux1
    {
        type            wallHeatFlux;
        libs            (fieldFunctionObjects);
        patches         (tube);
        writeControl    writeTime;
    }

    fieldMinMax1
    {
        type            fieldMinMax;
        libs            (fieldFunctionObjects);
        fields          (U p T);
        writeControl    timeStep;
        writeInterval   50;
    }
}

// ************************************************************************* //
